NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l_erratas.h
#ifndef NRF54L_ERRATAS_H
#define NRF54L_ERRATAS_H

/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#include <stdint.h>
#include <stdbool.h>
#include "compiler_abstraction.h"

static inline bool nrf54l_errata_1(void);
static inline bool nrf54l_errata_2(void);
static inline bool nrf54l_errata_3(void);
static inline bool nrf54l_errata_4(void);
static inline bool nrf54l_errata_6(void);
static inline bool nrf54l_errata_7(void);
static inline bool nrf54l_errata_8(void);
static inline bool nrf54l_errata_9(void);
static inline bool nrf54l_errata_10(void);
static inline bool nrf54l_errata_13(void);
static inline bool nrf54l_errata_15(void);
static inline bool nrf54l_errata_16(void);
static inline bool nrf54l_errata_17(void);
static inline bool nrf54l_errata_18(void);
static inline bool nrf54l_errata_19(void);
static inline bool nrf54l_errata_20(void);
static inline bool nrf54l_errata_21(void);
static inline bool nrf54l_errata_22(void);
static inline bool nrf54l_errata_23(void);
static inline bool nrf54l_errata_24(void);
static inline bool nrf54l_errata_25(void);
static inline bool nrf54l_errata_26(void);
static inline bool nrf54l_errata_27(void);
static inline bool nrf54l_errata_28(void);
static inline bool nrf54l_errata_30(void);
static inline bool nrf54l_errata_31(void);
static inline bool nrf54l_errata_32(void);
static inline bool nrf54l_errata_33(void);
static inline bool nrf54l_errata_35(void);
static inline bool nrf54l_errata_37(void);
static inline bool nrf54l_errata_38(void);
static inline bool nrf54l_errata_39(void);
static inline bool nrf54l_errata_40(void);
static inline bool nrf54l_errata_41(void);
static inline bool nrf54l_errata_42(void);
static inline bool nrf54l_errata_43(void);
static inline bool nrf54l_errata_44(void);
static inline bool nrf54l_errata_45(void);
static inline bool nrf54l_errata_46(void);
static inline bool nrf54l_errata_47(void);
static inline bool nrf54l_errata_48(void);
static inline bool nrf54l_errata_49(void);
static inline bool nrf54l_errata_50(void);
static inline bool nrf54l_errata_54(void);
static inline bool nrf54l_errata_55(void);
static inline bool nrf54l_configuration_56(void);
static inline bool nrf54l_errata_57(void);
static inline bool nrf54l_errata_58(void);
static inline bool nrf54l_errata_59(void);
static inline bool nrf54l_errata_60(void);
static inline bool nrf54l_errata_63(void);
static inline bool nrf54l_errata_64(void);
static inline bool nrf54l_errata_65(void);
static inline bool nrf54l_errata_66(void);
static inline bool nrf54l_errata_68(void);
static inline bool nrf54l_errata_69(void);
static inline bool nrf54l_errata_70(void);
static inline bool nrf54l_errata_71(void);
static inline bool nrf54l_errata_72(void);
static inline bool nrf54l_errata_73(void);
static inline bool nrf54l_errata_74(void);
static inline bool nrf54l_errata_78(void);
static inline bool nrf54l_errata_79(void);
static inline bool nrf54l_errata_81(void);
static inline bool nrf54l_errata_83(void);
static inline bool nrf54l_errata_84(void);
static inline bool nrf54l_errata_85(void);
static inline bool nrf54l_errata_86(void);
static inline bool nrf54l_errata_87(void);
static inline bool nrf54l_errata_88(void);
static inline bool nrf54l_errata_89(void);
static inline bool nrf54l_errata_90(void);
static inline bool nrf54l_errata_91(void);
static inline bool nrf54l_errata_92(void);
static inline bool nrf54l_errata_93(void);
static inline bool nrf54l_errata_94(void);
static inline bool nrf54l_errata_95(void);
static inline bool nrf54l_errata_100(void);
static inline bool nrf54l_errata_101(void);
static inline bool nrf54l_errata_102(void);
static inline bool nrf54l_errata_103(void);
static inline bool nrf54l_errata_104(void);
static inline bool nrf54l_errata_105(void);
static inline bool nrf54l_errata_106(void);
static inline bool nrf54l_errata_109(void);
static inline bool nrf54l_errata_111(void);
static inline bool nrf54l_errata_112(void);
static inline bool nrf54l_errata_114(void);
static inline bool nrf54l_errata_115(void);
static inline bool nrf54l_errata_116(void);
static inline bool nrf54l_errata_120(void);
static inline bool nrf54l_errata_121(void);
static inline bool nrf54l_errata_126(void);
static inline bool nrf54l_errata_129(void);
static inline bool nrf54l_errata_132(void);
static inline bool nrf54l_errata_139(void);

/* ========= Errata 1 ========= */
#if    defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05) \
    || defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10) \
    || defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
    #define NRF54L_ERRATA_1_PRESENT 1
#else
    #define NRF54L_ERRATA_1_PRESENT 0
#endif

