NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l_erratas.h
#ifndef NRF54L_ERRATA_84_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_84_ENABLE_WORKAROUND NRF54L_ERRATA_84_PRESENT
#endif

static inline bool nrf54l_errata_84(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)\
         || defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)
            if (var1 == 0x33)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return false;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 85 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_85_PRESENT 1
#else
    #define NRF54L_ERRATA_85_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_85_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_85_ENABLE_WORKAROUND NRF54L_ERRATA_85_PRESENT
#endif

static inline bool nrf54l_errata_85(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 86 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_86_PRESENT 1
#else
    #define NRF54L_ERRATA_86_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_86_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_86_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_86(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 87 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_87_PRESENT 1
#else
    #define NRF54L_ERRATA_87_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_87_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_87_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_87(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 88 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_88_PRESENT 1
#else
    #define NRF54L_ERRATA_88_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_88_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_88_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_88(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 89 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_89_PRESENT 1
#else
    #define NRF54L_ERRATA_89_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_89_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_89_ENABLE_WORKAROUND NRF54L_ERRATA_89_PRESENT
#endif

static inline bool nrf54l_errata_89(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

