NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l_erratas.h
/* ========= Errata 90 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_90_PRESENT 1
#else
    #define NRF54L_ERRATA_90_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_90_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_90_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_90(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 91 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_91_PRESENT 1
#else
    #define NRF54L_ERRATA_91_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_91_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_91_ENABLE_WORKAROUND NRF54L_ERRATA_91_PRESENT
#endif

static inline bool nrf54l_errata_91(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 92 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_92_PRESENT 1
#else
    #define NRF54L_ERRATA_92_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_92_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_92_ENABLE_WORKAROUND NRF54L_ERRATA_92_PRESENT
#endif

static inline bool nrf54l_errata_92(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 93 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_93_PRESENT 1
#else
    #define NRF54L_ERRATA_93_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_93_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_93_ENABLE_WORKAROUND NRF54L_ERRATA_93_PRESENT
#endif

static inline bool nrf54l_errata_93(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 94 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_94_PRESENT 1
#else
    #define NRF54L_ERRATA_94_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_94_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_94_ENABLE_WORKAROUND NRF54L_ERRATA_94_PRESENT
#endif

static inline bool nrf54l_errata_94(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 95 ========= */
#if    defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
    #define NRF54L_ERRATA_95_PRESENT 1
#else
    #define NRF54L_ERRATA_95_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_95_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_95_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_95(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 100 ========= */
#if    defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05) \
    || defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10) \
    || defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
    #define NRF54L_ERRATA_100_PRESENT 1
#else
    #define NRF54L_ERRATA_100_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_100_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_100_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_100(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05)\
         || defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10)\
         || defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            if (var1 == 0x1C)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10)
            if (var1 == 0x2E)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05)
            if (var1 == 0x2F)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

