NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l_erratas.h
static inline bool nrf54l_errata_120(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05)\
         || defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10)\
         || defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)\
         || defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)\
         || defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            if (var1 == 0x1C)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10)
            if (var1 == 0x2E)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05)
            if (var1 == 0x2F)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)
            if (var1 == 0x33)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return false;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 121 ========= */
#if    defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
    #define NRF54L_ERRATA_121_PRESENT 1
#else
    #define NRF54L_ERRATA_121_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_121_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_121_ENABLE_WORKAROUND NRF54L_ERRATA_121_PRESENT
#endif

static inline bool nrf54l_errata_121(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            if (var1 == 0x1C)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 126 ========= */
#if    defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B) \
    || defined (NRF54LS05A_XXAA) || defined (DEVELOP_IN_NRF54LS05A)
    #define NRF54L_ERRATA_126_PRESENT 1
#else
    #define NRF54L_ERRATA_126_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_126_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_126_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_126(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B)\
         || defined (NRF54LS05A_XXAA) || defined (DEVELOP_IN_NRF54LS05A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B)
            if (var1 == 0x34)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LS05A_XXAA) || defined (DEVELOP_IN_NRF54LS05A)
            if (var1 == 0x36)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 129 ========= */
#if    defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15) \
    || defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A) \
    || defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B) \
    || defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B) \
    || defined (NRF54LV10A_XXAA) || defined (DEVELOP_IN_NRF54LV10A)
    #define NRF54L_ERRATA_129_PRESENT 1
#else
    #define NRF54L_ERRATA_129_PRESENT 0
#endif

#ifndef NRF54L_ERRATA_129_ENABLE_WORKAROUND
    #define NRF54L_ERRATA_129_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54l_errata_129(void)
{
    #ifndef NRF54L_SERIES
        return false;
    #else
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)\
         || defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)\
         || defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)\
         || defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B)\
         || defined (NRF54LV10A_XXAA) || defined (DEVELOP_IN_NRF54LV10A)
            uint32_t var1 = *(uint32_t *)0x00FFC340ul;
            uint32_t var2 = *(uint32_t *)0x00FFC344ul;
        #endif
        #if defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15)
            if (var1 == 0x1C)
            {
                switch(var2)
                {
                    case 0x01ul:
                        return true;
                    case 0x02ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        #if defined (NRF54LV10A_XXAA) || defined (DEVELOP_IN_NRF54LV10A)
            if (var1 == 0x27)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x02ul:
                        return false;
                    default:
                        return false;
                }
            }
        #endif
        #if defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A)
            if (var1 == 0x29)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B)
            if (var1 == 0x33)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return false;
                    case 0x01ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        #if defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B)
            if (var1 == 0x34)
            {
                switch(var2)
                {
                    case 0x00ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 132 ========= */
#if    defined (NRF54L05_XXAA) || defined (DEVELOP_IN_NRF54L05) \
    || defined (NRF54L10_XXAA) || defined (DEVELOP_IN_NRF54L10) \
    || defined (NRF54L15_XXAA) || defined (DEVELOP_IN_NRF54L15) \
    || defined (NRF54LM20A_XXAA) || defined (DEVELOP_IN_NRF54LM20A) \
    || defined (NRF54LM20B_XXAA) || defined (DEVELOP_IN_NRF54LM20B) \
    || defined (NRF54LS05B_XXAA) || defined (DEVELOP_IN_NRF54LS05B) \
    || defined (NRF54LV10A_XXAA) || defined (DEVELOP_IN_NRF54LV10A) \
    || defined (NRF54LC10A_XXAA) || defined (DEVELOP_IN_NRF54LC10A) \
    || defined (NRF54LS05A_XXAA) || defined (DEVELOP_IN_NRF54LS05A)
    #define NRF54L_ERRATA_132_PRESENT 1
#else
    #define NRF54L_ERRATA_132_PRESENT 0
#endif

